In [1]:
import pandas as pd
import numpy as np

In [7]:
obj = pd.Series(np.arange(4), index=['a', 'b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [5]:
print(obj['b'])
print(obj[1])
print(obj[2:4])
print(obj[['b', 'a', 'd']])
print(obj[[0, 1, 3]])
print(obj[obj<2])

1
1
c    2
d    3
dtype: int32
b    1
a    0
d    3
dtype: int32
a    0
b    1
d    3
dtype: int32
a    0
b    1
dtype: int32

In [6]:
obj['b', 'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [10]:
#  pd.DataFrame(데이터,인덱스명,컬럼)
data = pd.DataFrame(np.arange(16).reshape(4, 4),
            index=['Seoul', 'Incheon', 'Suwon', 'Daejeon'],
            columns=['one', 'two', 'three', 'four'])

data

         one  two  three  four
Seoul      0    1      2     3
Incheon    4    5      6     7
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [11]:
data['two']

Seoul       1
Incheon     5
Suwon       9
Daejeon    13
Name: two, dtype: int32

In [12]:
data[['two', 'four']]

         two  four
Seoul      1     3
Incheon    5     7
Suwon      9    11
Daejeon   13    15

In [13]:
data.loc[['Seoul', 'Incheon']]

         one  two  three  four
Seoul      0    1      2     3
Incheon    4    5      6     7

In [14]:
data[data['three']>6]

         one  two  three  four
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [15]:
data<5

           one    two  three   four
Seoul     True   True   True   True
Incheon   True  False  False  False
Suwon    False  False  False  False
Daejeon  False  False  False  False

In [18]:
data[data<5]

         one  two  three  four
Seoul    0.0  1.0    2.0   3.0
Incheon  4.0  NaN    NaN   NaN
Suwon    NaN  NaN    NaN   NaN
Daejeon  NaN  NaN    NaN   NaN

In [19]:
data[data<5] = 0
data

         one  two  three  four
Seoul      0    0      0     0
Incheon    0    5      6     7
Suwon      8    9     10    11
Daejeon   12   13     14    15

In [22]:
#5와 6이 추출되도록
data.loc['Incheon', ['two', 'three']]

two      5
three    6
Name: Incheon, dtype: int32

In [24]:
#iloc를 이용한 데이터 추출
data.iloc[2, 1]
data.iloc[2, [1,2,0]]

two       9
three    10
one       8
Name: Suwon, dtype: int32

In [26]:
data.iloc[[1,3], [3,1,2]]

         four  two  three
Incheon     7    5      6
Daejeon    15   13     14

In [27]:
data.loc[:'Suwon','two']

Seoul      0
Incheon    5
Suwon      9
Name: two, dtype: int32

In [29]:
data.iloc[:,:3]

         one  two  three
Seoul      0    0      0
Incheon    0    5      6
Suwon      8    9     10
Daejeon   12   13     14

In [30]:
data.iloc[:,:3][data.three>5]

         one  two  three
Incheon    0    5      6
Suwon      8    9     10
Daejeon   12   13     14

In [33]:
ser = pd.Series(np.arange(3), index=['a', 'b', 'c'])
ser
ser[-1]

2

In [35]:
ser[:1]
ser.loc[:]

a    0
b    1
c    2
dtype: int32

In [36]:
s1 = pd.Series([7,-2,3,1], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([2,-3,4,2,5], index=['a', 'c', 'e', 'f', 'g'])